package constants.drop;

public class DropBoss {

    private static DropBoss instance = null;

    public static int dragonRider = 2;
    public static int normalZakum = 2;
    public static int normalHorntail = 2;
    public static int normalPinkbean = 2;
    public static int chaosZakum = 2;
    public static int chaosHorntail = 2;
    public static int chaosPinkbean = 2;
    public static int vonleon = 2;
    public static int hilla = 2;
    public static int akayrum = 2;
    public static int cygnus = 1;
    public static int magnus = 1;
    public static int blodyQueen = 1;
    public static int pierre = 1;
    public static int banban = 1;
    public static int bellum = 1;
    public static int lotus = 2;
    public static int demian = 2;
    public static int lucid = 2;
    public static int will = 2;
    public static int jinhillah = 2;
    public static int dunkel = 2;
    public static int blackmage = 2;
    public static int seren = 2;
    public static int kalos = 2;
    public static int karing = 2;
    public static int ranmaru = 2;
    public static int nohime = 2;
    public static int mitsuhide = 2;

    public static int[][] drop_boss = {
        /* 드래곤 라이더 */
        {1332100, 8300007}, // 니겔링
        {1382058, 8300007}, // 레바테인
        {1342009, 8300007}, // 용연도
        {1402073, 8300007}, // 아스카론
        {1442090, 8300007}, // 모글레이
        {1452058, 8300007}, // 바리사다
        {1472069, 8300007}, // 클립토
        {1482051, 8300007}, // 크루시오
        {1492024, 8300007}, // 템페스트
        {1432066, 8300007}, // 벨룸 스피어
        {1462076, 8300007}, // 인페르나
        {1532013, 8300007}, // 피하트 슈톨츠
        {1302226, 8300007}, // 라피스 라 소드
        {1312094, 8300007}, // 라피스 라 엑스
        {1322134, 8300007}, // 라피스 라 해머
        {1542047, 8300007}, // 라피스 라 용신환
        {1522013, 8300007}, // 나르쉘
        {1362014, 8300007}, // 앙쥬 데쉬
        {1552046, 8300007}, // 용신선
        {1332153, 8300007}, // 드래고닉 나겔링
        {1382127, 8300007}, // 드래고닉 레바테인
        {1342042, 8300007}, // 드래고닉 용연도
        {1402114, 8300007}, // 드래고닉 아스카론
        {1442139, 8300007}, // 드래고닉 모글레이
        {1452132, 8300007}, // 드래고닉 바리사다
        {1472144, 8300007}, // 드래고닉 클립토
        {1482105, 8300007}, // 드래고닉 크루시오
        {1492104, 8300007}, // 드래고닉 템페스트
        {1432102, 8300007}, // 드래고닉 벨룸 스피어
        {1462121, 8300007}, // 드래고닉 인페르나
        {1532040, 8300007}, // 드래고닉 피하트
        {1312097, 8300007}, // 드래고닉 라피스 라 엑스
        {1322137, 8300007}, // 드래고닉 라피스 라 해머
        {1522023, 8300007}, // 드래고닉 나르쉘
        {1362024, 8300007}, // 드래고닉 앙쥬 데쉬

        /* 자쿰 */
        {1022231, 8800002}, // 아쿠아틱 레터 눈장식
        {1252083, 8800002}, // 자쿰의 포이즈닉 스틱
        {1302312, 8800002}, // 자쿰의 포이즈닉 소드
        {1312182, 8800002}, // 자쿰의 포이즈닉 엑스
        {1322233, 8800002}, // 자쿰의 포이즈닉 해머
        {1332257, 8800002}, // 자쿰의 포이즈닉 대거
        {1342097, 8800002}, // 자쿰의 포이즈닉 블레이드
        {1362118, 8800002}, // 자쿰의 포이즈닉 케인
        {1372204, 8800002}, // 자쿰의 포이즈닉 완드
        {1382242, 8800002}, // 자쿰의 포이즈닉 스태프
        {1402233, 8800002}, // 자쿰의 포이즈닉 투 핸드 소드
        {1403009, 8800002}, // 자쿰의 포이즈닉 무권
        {1412161, 8800002}, // 자쿰의 포이즈닉 투 핸드 엑스
        {1422168, 8800002}, // 자쿰의 포이즈닉 빅 해머
        {1432197, 8800002}, // 자쿰의 포이즈닉 스피어
        {1442251, 8800002}, // 자쿰의 포이즈닉 폴암
        {1452235, 8800002}, // 자쿰의 포이즈닉 보우
        {1462222, 8800002}, // 자쿰의 포이즈닉 크로스 보우
        {1472244, 8800002}, // 자쿰의 포이즈닉 가즈
        {1482199, 8800002}, // 자쿰의 포이즈닉 너클
        {1492209, 8800002}, // 자쿰의 포이즈닉 건
        {1522121, 8800002}, // 자쿰의 포이즈닉 듀얼 보우건
        {1532127, 8800002}, // 자쿰의 포이즈닉 핸드 캐논
        {1542098, 8800002}, // 자쿰의 포이즈닉 카타나
        {1552099, 8800002}, // 자쿰의 포이즈닉 채선

        {2280007, 8800002},
        {2280008, 8800002},
        {2280012, 8800002},
        {2280014, 8800002},
        {2280015, 8800002},
        {2280016, 8800002},
        {2280013, 8800002},
        {2280004, 8800002},
        {2280009, 8800002},
        {2280026, 8800002},
        {2280027, 8800002},
        {2280008, 8800002},
        {2280029, 8800002},
        {2280005, 8800002},
        {2280006, 8800002},
        {2280010, 8800002},
        {2280030, 8800002},
        {2280031, 8800002},
        
        /* 카오스 자쿰 */
        {1012478, 8800102}, // 응축 된 힘의 결정석
        {1252083, 8800102}, // 자쿰의 포이즈닉 스틱
        {1302312, 8800102}, // 자쿰의 포이즈닉 소드
        {1312182, 8800102}, // 자쿰의 포이즈닉 엑스
        {1322233, 8800102}, // 자쿰의 포이즈닉 해머
        {1332257, 8800102}, // 자쿰의 포이즈닉 대거
        {1342097, 8800102}, // 자쿰의 포이즈닉 블레이드
        {1362118, 8800102}, // 자쿰의 포이즈닉 케인
        {1372204, 8800102}, // 자쿰의 포이즈닉 완드
        {1382242, 8800102}, // 자쿰의 포이즈닉 스태프
        {1402233, 8800102}, // 자쿰의 포이즈닉 투 핸드 소드
        {1403009, 8800102}, // 자쿰의 포이즈닉 무권
        {1412161, 8800102}, // 자쿰의 포이즈닉 투 핸드 엑스
        {1422168, 8800102}, // 자쿰의 포이즈닉 빅 해머
        {1432197, 8800102}, // 자쿰의 포이즈닉 스피어
        {1442251, 8800102}, // 자쿰의 포이즈닉 폴암
        {1452235, 8800102}, // 자쿰의 포이즈닉 보우
        {1462222, 8800102}, // 자쿰의 포이즈닉 크로스 보우
        {1472244, 8800102}, // 자쿰의 포이즈닉 가즈
        {1482199, 8800102}, // 자쿰의 포이즈닉 너클
        {1492209, 8800102}, // 자쿰의 포이즈닉 건
        {1522121, 8800102}, // 자쿰의 포이즈닉 듀얼 보우건
        {1532127, 8800102}, // 자쿰의 포이즈닉 핸드 캐논
        {1542098, 8800102}, // 자쿰의 포이즈닉 카타나
        {1552099, 8800102}, // 자쿰의 포이즈닉 채선

        /* 혼테일 */
        {1302059, 8810018}, // 드래곤 카라벨라
        {1322052, 8810018}, // 드래곤 메이스
        {1402036, 8810018}, // 드래곤 클레이모어
        {1312031, 8810018}, // 드래곤 엑스
        {1412026, 8810018}, // 드래곤 배틀 엑스
        {1422028, 8810018}, // 드래곤 플레임
        {1432038, 8810018}, // 드래곤 팔티잔
        {1442045, 8810018}, // 드래곤 핼버드
        {1542010, 8810018}, // 봉황환
        {1372032, 8810018}, // 드래곤 완드
        {1382036, 8810018}, // 드래곤 스태프
        {1552056, 8810018}, // 자첩선
        {1252010, 8810018}, // 드래곤 키튼 소울 스틱
        {1452044, 8810018}, // 드래곤 샤인 보우
        {1462039, 8810018}, // 드래곤 샤인 크로스
        {1522014, 8810018}, // 드래곤 하이네스
        {1472051, 8810018}, // 드래곤 그린 슬레브
        {1472052, 8810018}, // 드래곤 퍼플 슬레브
        {1332049, 8810018}, // 드래곤 칸자르
        {1332050, 8810018}, // 드래곤 크리스
        {1342010, 8810018}, // 청월도
        {1362015, 8810018}, // 드래곤 펄 만시
        {1482013, 8810018}, // 용아주조
        {1492013, 8810018}, // 드래곤 세인트
        {1532014, 8810018}, // 드래곤 헤르츠
        {1403008, 8810018}, // 폭룡 무권

        /* 카오스 혼테일 */
        {1113149, 8810122}, // 실버 블라썸 링
        {1032241, 8810122}, // 데아 시두스 이어링
        {1302059, 8810122}, // 드래곤 카라벨라
        {1322052, 8810122}, // 드래곤 메이스
        {1402036, 8810122}, // 드래곤 클레이모어
        {1312031, 8810122}, // 드래곤 엑스
        {1412026, 8810122}, // 드래곤 배틀 엑스
        {1422028, 8810122}, // 드래곤 플레임
        {1432038, 8810122}, // 드래곤 팔티잔
        {1442045, 8810122}, // 드래곤 핼버드
        {1542010, 8810122}, // 봉황환
        {1372032, 8810122}, // 드래곤 완드
        {1382036, 8810122}, // 드래곤 스태프
        {1552056, 8810122}, // 자첩선
        {1252010, 8810122}, // 드래곤 키튼 소울 스틱
        {1452044, 8810122}, // 드래곤 샤인 보우
        {1462039, 8810122}, // 드래곤 샤인 크로스
        {1522014, 8810122}, // 드래곤 하이네스
        {1472051, 8810122}, // 드래곤 그린 슬레브
        {1472052, 8810122}, // 드래곤 퍼플 슬레브
        {1332049, 8810122}, // 드래곤 칸자르
        {1332050, 8810122}, // 드래곤 크리스
        {1342010, 8810122}, // 청월도
        {1362015, 8810122}, // 드래곤 펄 만시
        {1482013, 8810122}, // 용아주조
        {1492013, 8810122}, // 드래곤 세인트
        {1532014, 8810122}, // 드래곤 헤르츠
        {1403008, 8810122}, // 폭룡 무권

        /* 핑크빈 */
        {1132272, 8820001}, // 골든 클로버 벨트
        {1162025, 8820001}, // 핑크빛 성배
        {1022232, 8820001}, // 블랙빈 마크
        {1002790, 8820001}, // 리버스 휜넬
        {1002791, 8820001}, // 리버스 코럴
        {1002792, 8820001}, // 리버스 라피드
        {1002793, 8820001}, // 리버스 차이브
        {1002794, 8820001}, // 리버스 콘라드 헨켈
        {1052160, 8820001}, // 리버스 티라곤
        {1052161, 8820001}, // 리버스 미스트 블루
        {1052612, 8820001}, // 리버스 에버뉴
        {1052163, 8820001}, // 리버스 프린지드
        {1052164, 8820001}, // 리버스 부르군트
        {1072361, 8820001}, // 리버스 그라베
        {1072362, 8820001}, // 리버스 카바티나
        {1072363, 8820001}, // 리버스 론타노
        {1072364, 8820001}, // 리버스 문스티드
        {1072365, 8820001}, // 리버스 파라온
        {1082238, 8820001}, // 리버스 차알스톤
        {1082239, 8820001}, // 리버스 베르가못
        {1082240, 8820001}, // 리버스 헤르모사
        {1082241, 8820001}, // 리버스 프레스토
        {1082242, 8820001}, // 리버스 루바브
        {1302086, 8820001}, // 리버스 엑서큐서너스
        {1312038, 8820001}, // 리버스 버디슈
        {1322061, 8820001}, // 리버스 알라르간도
        {1332075, 8820001}, // 리버스 페스카즈
        {1332076, 8820001}, // 리버스 킬릭
        {1342012, 8820001}, // 리버스 코션
        {1372045, 8820001}, // 리버스 엔릴 티어
        {1382059, 8820001}, // 리버스 에아스 핸드
        {1402046, 8820001}, // 리버스 니플하임
        {1412034, 8820001}, // 리버스 타바르진
        {1422038, 8820001}, // 리버스 벨로체
        {1432049, 8820001}, // 리버스 알슈피스
        {1422067, 8820001}, // 리버스 디에스 이라에
        {1452059, 8820001}, // 리버스 엔가우
        {1462051, 8820001}, // 리버스 블랙 뷰티
        {1472071, 8820001}, // 리버스 람피온
        {1482024, 8820001}, // 리버스 에퀴녹스
        {1492025, 8820001}, // 리버스 블라인드 니스
        {1942002, 8820001}, // 리버스 마스크
        {1952002, 8820001}, // 리버스 펜던트
        {1962002, 8820001}, // 리버스 윙즈
        {1972002, 8820001}, // 리버스 테일
        {1532016, 8820001}, // 리버스 셀베이션
        {1522016, 8820001}, // 리버스 피오니
        {1362017, 8820001}, // 리버스 페르소나
        {1542012, 8820001}, // 리버스 명도 천지개벽
        {1552012, 8820001}, // 리버스 취성선
        {1252012, 8820001}, // 리버스 키티 프라이드 스틱
        {1403010, 8820001}, // 리버스 무권
        {1092057, 8820001}, // 타임리스 프렐류드
        {1092058, 8820001}, // 타임리스 카이트 실드
        {1092059, 8820001}, // 타임리스 리스트
        {1002776, 8820001}, // 타임리스 휀넬
        {1002777, 8820001}, // 타임리스 코럴
        {1002778, 8820001}, // 타임리스 라피드
        {1002779, 8820001}, // 타임리스 차이브
        {1002780, 8820001}, // 타임리스 콘라드 헨켈
        {1052155, 8820001}, // 타임리스 타라곤
        {1052156, 8820001}, // 타임리스 미스트 블루
        {1052157, 8820001}, // 타임리스 에버뉴
        {1052158, 8820001}, // 타임리스 프린지드
        {1052159, 8820001}, // 타임리스 부르군트
        {1072355, 8820001}, // 타임리스 그라베
        {1072356, 8820001}, // 타임리스 카바티나
        {1072357, 8820001}, // 타임리스 론타노
        {1072358, 8820001}, // 타임리스 문스티드
        {1072359, 8820001}, // 타임리스 파라온
        {1082234, 8820001}, // 타임리스 베르가못
        {1082235, 8820001}, // 타임리스 헤르모사
        {1082236, 8820001}, // 타임리스 프레스토
        {1082237, 8820001}, // 타임리스 루바브
        {1082238, 8820001}, // 타임리스 차알스톤
        {1302081, 8820001}, // 타임리스 엑서큐서너스
        {1312037, 8820001}, // 타임리스 버디슈
        {1322060, 8820001}, // 타임리스 알라르간도
        {1332073, 8820001}, // 타임리스 페스카즈
        {1332074, 8820001}, // 타임리스 킬릭
        {1342011, 8820001}, // 타임리스 코션
        {1372044, 8820001}, // 타임리스 엔릴 티어
        {1382057, 8820001}, // 타임리스 에아스 핸드
        {1402046, 8820001}, // 타임리스 니플하임
        {1412033, 8820001}, // 타임리스 타바르진
        {1422037, 8820001}, // 타임리스 벨로체
        {1432047, 8820001}, // 타임리스 알슈피스
        {1442063, 8820001}, // 타임리스 디에스이라에
        {1452057, 8820001}, // 타임리스 엔가우
        {1462050, 8820001}, // 타임리스 블랙 뷰티
        {1472068, 8820001}, // 타임리스 람피온
        {1482023, 8820001}, // 타임리스 에퀴녹스
        {1492023, 8820001}, // 타임리스 블라인드 니스
        {1532015, 8820001}, // 타임리스 셀베이션
        {1522015, 8820001}, // 타임리스 피오니
        {1362016, 8820001}, // 타임리스 페르소나
        {1032031, 8820001}, // 타임리스 이어링
        {1122012, 8820001}, // 타임리스 펜던트

        /* 반 레온 */
        {1122274, 8840000}, // 이피아의 목걸이
        {1032227, 8840000}, // 이피아의 귀고리
        {1113089, 8840000}, // 이피아의 반지

        {1113282, 8840000}, // 고귀한 이피아의 반지

        {1003154, 8840000}, // 막스 반 레온 헬멧
        {1003155, 8840000}, // 알마 반 레온 헬멧
        {1003156, 8840000}, // 팍스 반 레온 헬멧
        {1003157, 8840000}, // 녹스 반 레온 헬멧
        {1003158, 8840000}, // 코라 반 레온 헬멧

        {1102262, 8840000}, // 막스 반 레온 망토
        {1102263, 8840000}, // 알마 반 레온 망토
        {1102264, 8840000}, // 팍스 반 레온 망토
        {1102265, 8840000}, // 녹스 반 레온 망토
        {1102266, 8840000}, // 코라 반 레온 망토

        {1082285, 8840000}, // 막스 반 레온 핸드 가드
        {1082286, 8840000}, // 알마 반 레온 핸드 가드
        {1082287, 8840000}, // 팍스 반 레온 핸드 가드
        {1082288, 8840000}, // 녹스 반 레온 핸드 가드
        {1082289, 8840000}, // 코라 반 레온 핸드 가드

        {1052299, 8840000}, // 막스 반 레온 배틀 슈트
        {1052300, 8840000}, // 알마 반 레온 배틀 슈트
        {1052301, 8840000}, // 팍스 반 레온 배틀 슈트
        {1052302, 8840000}, // 녹스 반 레온 배틀 슈트
        {1052303, 8840000}, // 코라 반 레온 배틀 슈트

        {1072471, 8840000}, // 막스 반 레온 워 부츠
        {1072472, 8840000}, // 알마 반 레온 워 부츠
        {1072473, 8840000}, // 팍스 반 레온 워 부츠
        {1072474, 8840000}, // 녹스 반 레온 워 부츠
        {1072475, 8840000}, // 코라 반 레온 워 부츠

        {1302149, 8840000}, // 막스 반 레온 세이버
        {1312095, 8840000}, // 막스 반 레온 엑스
        {1322135, 8840000}, // 막스 반 레온 해머
        {1402091, 8840000}, // 막스 반 레온 스워드
        {1432084, 8840000}, // 막스 반 레온 스피어
        {1442113, 8840000}, // 막스 반 레온 핼버드
        {1542014, 8840000}, // 막스 반 레온 명도 오니키리
        {1252016, 8840000}, // 알마 반 레온 라이온 글라스 스틱
        {1372080, 8840000}, // 알마 반 레온 완드
        {1382102, 8840000}, // 알마 반 레온 스태프
        {1552014, 8840000}, // 알마 반 레온 채선 오니부시
        {1452107, 8840000}, // 팍스 반 레온 보우
        {1462094, 8840000}, // 팍스 반 레온 크로스 보우
        {1522056, 8840000}, // 팍스 반 레온 듀얼 보우건
        {1332126, 8840000}, // 녹스 반 레온 대거
        {1362020, 8840000}, // 녹스 반 레온 케인
        {1472118, 8840000}, // 녹스 반 레온 가즈
        {1482080, 8840000}, // 코라 반 레온 클로
        {1492081, 8840000}, // 코라 반 레온 피스톨
        {1532019, 8840000}, // 코라 반 레온 시즈건
        /*
        {2510355, 8840000}, // 빅터 반 레온 헬멧 제작 레시피
        {2510356, 8840000}, // 빅터 반 레온 배틀 슈트 제작 레시피
        {2510357, 8840000}, // 빅터 반 레온 워 부츠 제작 레시피
        {2510358, 8840000}, // 빅터 반 레온 핸드 가드 제작 레시피
        {2510359, 8840000}, // 빅터 반 레온 망토 제작 레시피
        {2510360, 8840000}, // 빅터 반 레온 세이버 제작 레시피
        {2510361, 8840000}, // 빅터 반 레온 스워드 제작 레시피
        {2510362, 8840000}, // 빅터 반 레온 스피어 제작 레시피
        {2510363, 8840000}, // 빅터 반 레온 핼버드 제작 레시피
        {2510364, 8840000}, // 헥스 반 레온 헬멧 제작 레시피
        {2510365, 8840000}, // 헥스 반 레온 배틀 슈트 제작 레시피
        {2510366, 8840000}, // 헥스 반 레온 워 부츠 제작 레시피
        {2510367, 8840000}, // 헥스 반 레온 핸드 가드 제작 레시피
        {2510368, 8840000}, // 헥스 반 레온 망토 제작 레시피
        {2510369, 8840000}, // 헥스 반 레온 완드 제작 레시피
        {2510370, 8840000}, // 헥스 반 레온 스태프 제작 레시피
        {2510371, 8840000}, // 셀린 반 레온 헬멧 제작 레시피
        {2510372, 8840000}, // 셀린 반 레온 배틀 슈트 제작 레시피
        {2510373, 8840000}, // 셀린 반 레온 워 부츠 제작 레시피
        {2510374, 8840000}, // 셀린 반 레온 핸드 가드 제작 레시피
        {2510375, 8840000}, // 셀린 반 레온 망토 제작 레시피
        {2510376, 8840000}, // 셀린 반 레온 보우 제작 레시피
        {2510377, 8840000}, // 셀린 반 레온 크로스 보우 제작 레시피
        {2510379, 8840000}, // 스카 반 레온 헬멧 제작 레시피
        {2510380, 8840000}, // 스카 반 레온 배틀 슈트 제작 레시피
        {2510381, 8840000}, // 스카 반 레온 워 부츠 제작 레시피
        {2510382, 8840000}, // 스카 반 레온 핸드 가드 제작 레시피
        {2510383, 8840000}, // 스카 반 레온 망토 제작 레시피
        {2510384, 8840000}, // 스카 반 레온 대거 제작 레시피
        {2510385, 8840000}, // 스카 반 레온 가즈 제작 레시피
        {2510386, 8840000}, // 메르 반 레온 헬멧 제작 레시피
        {2510387, 8840000}, // 메르 반 레온 배틀 슈트 제작 레시피
        {2510388, 8840000}, // 메르 반 레온 워 부츠 제작 레시피
        {2510389, 8840000}, // 메르 반 레온 핸드 가드 제작 레시피
        {2510390, 8840000}, // 메르 반 레온 망토 제작 레시피
        {2510391, 8840000}, // 메르 반 레온 클로 제작 레시피
        {2510392, 8840000}, // 메르 반 레온 피스톨 제작 레시피
        {2510393, 8840000}, // 메르 반 레온 시즈 건 제작 레시피
        {2510432, 8840000}, // 셀린 반 레온 듀얼 보우건 제작 레시피
        {2510436, 8840000}, // 빅터 반 레온 엑스 제작 레시피
        {2510437, 8840000}, // 빅터 반 레온 해머 제작 레시피
        {2510478, 8840000}, // 스카 반 레온 케인 제작 레시피
        {2511135, 8840000}, // 빅터 반 레온 벨트 제작 레시피
        {2511136, 8840000}, // 헥스 반 레온 벨트 제작 레시피
        {2511137, 8840000}, // 셀린 반 레온 벨트 제작 레시피
        {2511138, 8840000}, // 스카 반 레온 벨트 제작 레시피
        {2511139, 8840000}, // 메르 반 레온 벨트 제작 레시피
        {2512264, 8840000}, // 스페셜 반 레온 변신 포션 제작 레시피
         */
        /* 시그너스 */
        {1102275, 8850011}, // 라이온 하트 배틀 케이프
        {1102276, 8850011}, // 드래곤 테일 메이지 케이프
        {1102277, 8850011}, // 팔콘 윙 센티널 케이프
        {1102278, 8850011}, // 레이븐 혼 체이서 케이프
        {1102279, 8850011}, // 샤크투스 스키퍼 케이프

        {1003172, 8850011}, // 라이온 하트 배틀 헬름
        {1003173, 8850011}, // 드래곤 테일 메이지 샐릿
        {1003174, 8850011}, // 팔콘 윙 센티널 캡
        {1003175, 8850011}, // 레이븐 혼 체이서 햇
        {1003176, 8850011}, // 샤크투스 스키퍼 햇

        {1052314, 8850011}, // 라이온 하트 배틀 메일
        {1052315, 8850011}, // 드래곤 테일 메이지 로브
        {1052316, 8850011}, // 팔콘 윙 센티널 슈트
        {1052317, 8850011}, // 레이븐 혼 체이서 아머
        {1052318, 8850011}, // 샤크투스 스키퍼 코트

        {1072485, 8850011}, // 라이온 하트 배틀 부츠
        {1072486, 8850011}, // 드래곤 테일 메이지 슈즈
        {1072487, 8850011}, // 팔콘 윙 센티널 부츠
        {1072488, 8850011}, // 레이븐 혼 체이서 부츠
        {1072489, 8850011}, // 샤크투스 스키퍼 부츠

        {1082295, 8850011}, // 라이온 하트 배틀 브레이서
        {1082296, 8850011}, // 드래곤 테일 메이지 피스트
        {1082297, 8850011}, // 팔콘 윙 센티널 글러브
        {1082298, 8850011}, // 레이븐 혼 체이서 글러브
        {1082299, 8850011}, // 샤크투스 스키퍼 글러브

        {1302152, 8850011}, // 라이온 하트 커틀러스
        {1312065, 8850011}, // 라이온 하트 챔피온 엑스
        {1322096, 8850011}, // 라이온 하트 배틀 해머
        {1402095, 8850011}, // 라이온 하트 배틀 시미터
        {1412065, 8850011}, // 라이온 하트 배틀 엑스
        {1422066, 8850011}, // 라이온 하트 기간틱 모울
        {1432086, 8850011}, // 라이온 하트 푸스키나
        {1442116, 8850011}, // 라이온 하트 파르티잔
        {1372084, 8850011}, // 드래곤 테일 아크 완드
        {1382104, 8850011}, // 드래곤 테일 워 스태프
        {1452111, 8850011}, // 팔콘 윙 컴포지트 보우
        {1462099, 8850011}, // 팔콘 윙 헤비 크로스 보우
        {1522018, 8850011}, // 팔콘 윙 그란 듀얼 보우건
        {1472122, 8850011}, // 레이븐 혼 메탈 피스트
        {1332130, 8850011}, // 레이븐 혼 바젤라드
        {1362019, 8850011}, // 레이븐 혼 크림슨 케인
        {1342036, 8850011}, // 레이븐 혼 섀도우 블레이드
        {1482084, 8850011}, // 샤크투스 와일드 탈론
        {1492085, 8850011}, // 샤크투스 샤프 슈터
        {1532018, 8850011}, // 샤크투스 플람

        /* 힐라 */
        {1032136, 8870000}, // 지옥의 불꽃
        {1004214, 8870000}, // 네크로 워리어 햇
        {1004215, 8870000}, // 네크로 매지션 햇
        {1004216, 8870000}, // 네크로 센티널 햇
        {1004217, 8870000}, // 네크로 체이서 햇
        {1004218, 8870000}, // 네크로 스키퍼 햇
        {1082593, 8870000}, // 네크로 워리어 글러브
        {1082594, 8870000}, // 네크로 매지션 글러브
        {1082595, 8870000}, // 네크로 센티널 글러브
        {1082596, 8870000}, // 네크로 체이서 글러브
        {1082597, 8870000}, // 네크로 스키퍼 글러브
        {1052784, 8870000}, // 네크로 워리어 슈트
        {1052785, 8870000}, // 네크로 매지션 슈트
        {1052786, 8870000}, // 네크로 센티널 슈트
        {1052787, 8870000}, // 네크로 체이서 슈트
        {1052788, 8870000}, // 네크로 스키퍼 슈트
        {1072952, 8870000}, // 네크로 워리어 슈즈
        {1072953, 8870000}, // 네크로 매지션 슈즈
        {1072954, 8870000}, // 네크로 센티널 슈즈
        {1072955, 8870000}, // 네크로 체이서 슈즈
        {1072956, 8870000}, // 네크로 스키퍼 슈즈
        {1252020, 8870000}, // 네크로 키튼 소울 스틱
        {1302213, 8870000}, // 네크로 피어
        {1312112, 8870000}, // 네크로 헤드
        {1322151, 8870000}, // 네크로 해머
        {1332187, 8870000}, // 네크로 슬레이어
        {1332188, 8870000}, // 네크로 페스카즈
        {1342066, 8870000}, // 네크로 블레이드
        {1362061, 8870000}, // 네크로 체스터
        {1372132, 8870000}, // 네크로 완드
        {1382159, 8870000}, // 네크로 로드
        {1402143, 8870000}, // 네크로 투핸더
        {1403011, 8870000}, // 네크로 무권
        {1412100, 8870000}, // 네크로 크로노
        {1422103, 8870000}, // 네크로 모울
        {1432133, 8870000}, // 네크로 스피어
        {1442171, 8870000}, // 네크로 폴암
        {1452163, 8870000}, // 네크로 롱 보우
        {1462153, 8870000}, // 네크로 크로스 보우
        {1472175, 8870000}, // 네크로 블러디 미스트
        {1482136, 8870000}, // 네크로 울프
        {1492136, 8870000}, // 네크로 이글
        {1522067, 8870000}, // 네크로 듀얼 보우건
        {1532071, 8870000}, // 네크로 이그니스
        {1542040, 8870000}, // 네크로멘서 블레이드
        {1552040, 8870000}, // 네크로멘서 채선
        {2510483, 8870000}, // 엠퍼러스 브레이브 기어 제작 레시피
        {2510484, 8870000}, // 엠퍼러스 메모리스 기어 제작 레시피
        {2510485, 8870000}, // 엠퍼러스 샤프니스 기어 제작 레시피
        {2510486, 8870000}, // 엠퍼러스 스위프트 기어 제작 레시피
        {2510487, 8870000}, // 엠퍼러스 퍼번트 기어 제작 레시피
        {2510488, 8870000}, // 엠퍼러스 브레이브 메일 제작 레시피
        {2510489, 8870000}, // 엠퍼러스 메모리스 메일 제작 레시피
        {2510490, 8870000}, // 엠퍼러스 샤프니스 메일 제작 레시피
        {2510491, 8870000}, // 엠퍼러스 스위프트 메일 제작 레시피
        {2510492, 8870000}, // 엠퍼러스 퍼번트 메일 제작 레시피
        {2510493, 8870000}, // 엠퍼러스 브레이브 부츠 제작 레시피
        {2510494, 8870000}, // 엠퍼러스 메모리스 부츠 제작 레시피
        {2510495, 8870000}, // 엠퍼러스 샤프니스 부츠 제작 레시피
        {2510496, 8870000}, // 엠퍼러스 스위프트 부츠 제작 레시피
        {2510497, 8870000}, // 엠퍼러스 퍼번트 부츠 제작 레시피
        {2510498, 8870000}, // 엠퍼러스 브레이브 건틀렛 제작 레시피
        {2510499, 8870000}, // 엠퍼러스 메모리스 건틀렛 제작 레시피
        {2510500, 8870000}, // 엠퍼러스 샤프니스 건틀렛 제작 레시피
        {2510501, 8870000}, // 엠퍼러스 스위프트 건틀렛 제작 레시피
        {2510502, 8870000}, // 엠퍼러스 퍼번트 건틀렛 제작 레시피
        {2510503, 8870000}, // 엠퍼러스 브레이브 케이프 제작 레시피
        {2510504, 8870000}, // 엠퍼러스 메모리스 케이프 제작 레시피
        {2510505, 8870000}, // 엠퍼러스 샤프니스 케이프 제작 레시피
        {2510506, 8870000}, // 엠퍼러스 스위프트 케이프 제작 레시피
        {2510507, 8870000}, // 엠퍼러스 퍼번트 케이프 제작 레시피
        {2510508, 8870000}, // 엠퍼러스 피어 제작 레시피
        {2510509, 8870000}, // 엠퍼러스 헤드 제작 레시피
        {2510510, 8870000}, // 엠퍼러스 해머 제작 레시피
        {2510511, 8870000}, // 엠퍼러스 슬레이어 제작 레시피
        {2510512, 8870000}, // 엠퍼러스 제스터 제작 레시피
        {2510513, 8870000}, // 엠퍼러스 완드 제작 레시피
        {2510514, 8870000}, // 엠퍼러스 로드 제작 레시피
        {2510515, 8870000}, // 엠퍼러스 기간틱 제작 레시피
        {2510516, 8870000}, // 엠퍼러스 모울 제작 레시피
        {2510517, 8870000}, // 엠퍼러스 스피어 제작 레시피
        {2510518, 8870000}, // 엠퍼러스 폴암 제작 레시피
        {2510519, 8870000}, // 엠퍼러스 롱 보우 제작 레시피
        {2510520, 8870000}, // 엠퍼러스 크로스 보우 제작 레시피
        {2510521, 8870000}, // 엠퍼러스 투핸더 제작 레시피
        {2510522, 8870000}, // 엠퍼러스 블러디 미스트 제작 레시피
        {2510523, 8870000}, // 엠퍼러스 울프 제작 레시피
        {2510524, 8870000}, // 엠퍼러스 이글 제작 레시피
        {2510525, 8870000}, // 엠퍼러스 듀얼 보우건 제작 레시피
        {2510526, 8870000}, // 엠퍼러스 이그니스 제작 레시피
        {2510527, 8870000}, // 엠퍼러스 블레이드 제작 레시피

        /* 아카이럼 */
        {1122254, 8860000}, // 매커네이터 펜던트
        {1122150, 8860000}, // 도미네이터 펜던트
        {1003285, 8860000}, // 피어리스 휀넬
        {1003286, 8860000}, // 피어리스 코럴
        {1003287, 8860000}, // 피어리스 라피드
        {1003288, 8860000}, // 피어리스 차이브
        {1003289, 8860000}, // 피어리스 콘라드 헨켈
        {1052379, 8860000}, // 피어리스 타라곤
        {1052380, 8860000}, // 피어리스 미스트 블루
        {1052381, 8860000}, // 피어리스 에버뉴
        {1052382, 8860000}, // 피어리스 프린지드
        {1052383, 8860000}, // 피어리스 부르군트
        {1072549, 8860000}, // 피어리스 그라베
        {1072550, 8860000}, // 피어리스 카바티나
        {1072551, 8860000}, // 피어리스 론타노
        {1072552, 8860000}, // 피어리스 문스티드
        {1072553, 8860000}, // 피어리스 파라온
        {1082333, 8860000}, // 피어리스 베르가못
        {1082334, 8860000}, // 피어리스 헤르모사
        {1082335, 8860000}, // 피어리스 프레스토
        {1082336, 8860000}, // 피어리스 루바브
        {1082337, 8860000}, // 피어리스 차알스톤
        {1302174, 8860000}, // 피어리스 엑서큐서너스
        {1312073, 8860000}, // 피어리스 버디슈
        {1322060, 8860000}, // 피어리스 알라르간도
        {1332150, 8860000}, // 피어리스 페스카즈
        {1332151, 8860000}, // 피어리스 킬릭
        {1342041, 8860000}, // 피어리스 코션
        {1372101, 8860000}, // 피어리스 엔릴 티어
        {1382125, 8860000}, // 피어리스 에아스 핸드
        {1402112, 8860000}, // 피어리스 니플하임
        {1412033, 8860000}, // 피어리스 타바르진
        {1422074, 8860000}, // 피어리스 벨로체
        {1432100, 8860000}, // 피어리스 알슈피스
        {1442137, 8860000}, // 피어리스 디에스 이라에
        {1452130, 8860000}, // 피어리스 엔가우
        {1462119, 8860000}, // 피어리스 블랙 뷰티
        {1472142, 8860000}, // 피어리스 람피온
        {1482103, 8860000}, // 피어리스 에퀴녹스
        {1492102, 8860000}, // 피어리스 블라인드 니스
        {1532038, 8860000}, // 피어리스 셀베이션
        {1092092, 8860000}, // 피어리스 프렐류드
        {1092093, 8860000}, // 피어리스 카이트 실드
        {1092094, 8860000}, // 피어리스 리스트
        {1102311, 8860000}, // 피어리스 문라이트
        {1522021, 8860000}, // 피어리스 피오니
        {1362023, 8860000}, // 피어리스 페르소나
        {1032108, 8860000}, // 피어리스 이어링
        {1122148, 8860000}, // 피어리스 펜던트

        /* 매그너스 */
        {1402179, 8880000}, // 저주받은 카이세리움
        {1152170, 8880000}, // 로얄 블랙 메탈 숄더
        {1182087, 8880000}, // 크리스탈 웬투스 뱃지
        {1132169, 8880000}, // 노바 히아데스 벨트
        {1132170, 8880000}, // 노바 헤르메스 벨트
        {1132171, 8880000}, // 노바 케이론 벨트
        {1132172, 8880000}, // 노바 리카온 벨트
        {1132173, 8880000}, // 노바 알테어 벨트
        {1132174, 8880000}, // 타일런트 히아데스 벨트
        {1132175, 8880000}, // 타일런트 헤르메스 벨트
        {1132176, 8880000}, // 타일런트 케이론 벨트
        {1132177, 8880000}, // 타일런트 리카온 벨트
        {1132178, 8880000}, // 타일런트 알테어 벨트
        {1102476, 8880000}, // 노바 히아데스 클록
        {1102477, 8880000}, // 노바 헤르메스 클록
        {1102478, 8880000}, // 노바 케이론 클록
        {1102479, 8880000}, // 노바 리카온 클록
        {1102480, 8880000}, // 노바 알테어 클록
        {1102481, 8880000}, // 타일런트 히아데스 클록
        {1102482, 8880000}, // 타일런트 헤르메스 클록
        {1102483, 8880000}, // 타일런트 케이론 클록
        {1102484, 8880000}, // 타일런트 리카온 클록
        {1102485, 8880000}, // 타일런트 알테어 클록
        {1072737, 8880000}, // 노바 히아데스 부츠
        {1072738, 8880000}, // 노바 헤르메스 부츠
        {1072739, 8880000}, // 노바 케이론 부츠
        {1072740, 8880000}, // 노바 리카온 부츠
        {1072741, 8880000}, // 노바 알테어 부츠

        /* 블러디 퀸 */
        {4310064, 8920000}, // 이그드라실 룬의 돌
        {4310065, 8920000}, // 카오스 이그드라실 룬의 돌
        {1003717, 8920000}, // 퀸의 티아라
        {1003721, 8920000}, // 카오스 퀸의 티아라
        {3010514, 8920000}, // 무서워요 퀸

        {4310064, 8920001}, // 이그드라실 룬의 돌
        {4310065, 8920001}, // 카오스 이그드라실 룬의 돌
        {1003717, 8920001}, // 퀸의 티아라
        {1003721, 8920001}, // 카오스 퀸의 티아라
        {3010514, 8920001}, // 무서워요 퀸

        {4310064, 8920002}, // 이그드라실 룬의 돌
        {4310065, 8920002}, // 카오스 이그드라실 룬의 돌
        {1003717, 8920002}, // 퀸의 티아라
        {1003721, 8920002}, // 카오스 퀸의 티아라
        {3010514, 8920002}, // 무서워요 퀸

        {4310064, 8920003}, // 이그드라실 룬의 돌
        {4310065, 8920003}, // 카오스 이그드라실 룬의 돌
        {1003717, 8920003}, // 퀸의 티아라
        {1003721, 8920003}, // 카오스 퀸의 티아라
        {3010514, 8920003}, // 무서워요 퀸

        /* 피에르 */
        {4310064, 8900000}, // 이그드라실 룬의 돌
        {4310065, 8900000}, // 카오스 이그드라실 룬의 돌
        {1003715, 8900000}, // 피에르 모자
        {1003719, 8900000}, // 카오스 피에르 모자
        {3010513, 8900000}, // 즐거운 피에르

        {4310064, 8900001}, // 이그드라실 룬의 돌
        {4310065, 8900001}, // 카오스 이그드라실 룬의 돌
        {1003715, 8900001}, // 피에르 모자
        {1003719, 8900001}, // 카오스 피에르 모자
        {3010513, 8900001}, // 즐거운 피에르

        {4310064, 8900002}, // 이그드라실 룬의 돌
        {4310065, 8900002}, // 카오스 이그드라실 룬의 돌
        {1003715, 8900002}, // 피에르 모자
        {1003719, 8900002}, // 카오스 피에르 모자
        {3010513, 8900002}, // 즐거운 피에르

        /* 반반 */
        {4310064, 8910000}, // 이그드라실 룬의 돌
        {4310065, 8910000}, // 카오스 이그드라실 룬의 돌
        {1003716, 8910000}, // 반반 투구
        {1003720, 8910000}, // 카오스 반반 투구
        {3010512, 8910000}, // 반반과 함께

        /* 벨룸 */
        {4310064, 8930000}, // 이그드라실 룬의 돌
        {4310065, 8930000}, // 카오스 이그드라실 룬의 돌
        {1003718, 8930000}, // 벨룸의 헬름
        {1003722, 8930000}, // 카오스 벨룸의 헬름
        {3010515, 8930000}, // 기암괴석 의자

        /* 스우 */
        {2439975, 8240099}, // 홍옥의 보스 반지 상자

        {2049100, 8240099}, // 혼돈의 주문서 60%
        {2046829, 8240099}, // 악세서리 공격력 스크롤 100%
        {2046830, 8240099}, // 악세서리 마력 스크롤 100%

        {1004422, 8240099}, // 앱솔랩스 나이트 헬름
        {1052882, 8240099}, // 앱솔랩스 나이트 슈트
        {1073030, 8240099}, // 앱솔랩스 나이트 슈즈
        {1082636, 8240099}, // 앱솔랩스 나이트 글러브
        {1102775, 8240099}, // 앱솔랩스 나이트 케이프
        {1152174, 8240099}, // 앱솔랩스 나이트 숄더

        {1004423, 8240099}, // 앱솔랩스 메이지 크라운
        {1052887, 8240099}, // 앱솔랩스 메이지 슈트
        {1073032, 8240099}, // 앱솔랩스 메이지 슈즈
        {1082637, 8240099}, // 앱솔랩스 메이지 글러브
        {1102794, 8240099}, // 앱솔랩스 메이지 케이프
        {1152176, 8240099}, // 앱솔랩스 메이지 숄더

        {1004424, 8240099}, // 앱솔랩스 아처 후드
        {1052888, 8240099}, // 앱솔랩스 아처 슈트
        {1073033, 8240099}, // 앱솔랩스 아처 슈즈
        {1082638, 8240099}, // 앱솔랩스 아처 글러브
        {1102795, 8240099}, // 앱솔랩스 아처 케이프
        {1152177, 8240099}, // 앱솔랩스 아처 숄더

        {1004425, 8240099}, // 앱솔랩스 시프 캡
        {1052889, 8240099}, // 앱솔랩스 시프 슈트
        {1073034, 8240099}, // 앱솔랩스 시프 슈즈
        {1082639, 8240099}, // 앱솔랩스 시프 글러브
        {1102796, 8240099}, // 앱솔랩스 시프 케이프
        {1152178, 8240099}, // 앱솔랩스 시프 숄더

        {1004426, 8240099}, // 앱솔랩스 파이렛 페도라
        {1052890, 8240099}, // 앱솔랩스 파이렛 슈트
        {1073035, 8240099}, // 앱솔랩스 파이렛 슈즈
        {1082640, 8240099}, // 앱솔랩스 파이렛 글러브
        {1102797, 8240099}, // 앱솔랩스 파이렛 케이프
        {1152179, 8240099}, // 앱솔랩스 파이렛 숄더

        /* 데미안 */
        {2439975, 8880101}, // 홍옥의 보스 반지 상자

        {2049100, 8880101}, // 혼돈의 주문서 60%
        {2046829, 8880101}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880101}, // 악세서리 마력 스크롤 100%

        {1099015, 8880101}, // 루인 포스 실드

        {1004422, 8880101}, // 앱솔랩스 나이트 헬름
        {1052882, 8880101}, // 앱솔랩스 나이트 슈트
        {1073030, 8880101}, // 앱솔랩스 나이트 슈즈
        {1082636, 8880101}, // 앱솔랩스 나이트 글러브
        {1102775, 8880101}, // 앱솔랩스 나이트 케이프
        {1152174, 8880101}, // 앱솔랩스 나이트 숄더

        {1004423, 8880101}, // 앱솔랩스 메이지 크라운
        {1052887, 8880101}, // 앱솔랩스 메이지 슈트
        {1073032, 8880101}, // 앱솔랩스 메이지 슈즈
        {1082637, 8880101}, // 앱솔랩스 메이지 글러브
        {1102794, 8880101}, // 앱솔랩스 메이지 케이프
        {1152176, 8880101}, // 앱솔랩스 메이지 숄더

        {1004424, 8880101}, // 앱솔랩스 아처 후드
        {1052888, 8880101}, // 앱솔랩스 아처 슈트
        {1073033, 8880101}, // 앱솔랩스 아처 슈즈
        {1082638, 8880101}, // 앱솔랩스 아처 글러브
        {1102795, 8880101}, // 앱솔랩스 아처 케이프
        {1152177, 8880101}, // 앱솔랩스 아처 숄더

        {1004425, 8880101}, // 앱솔랩스 시프 캡
        {1052889, 8880101}, // 앱솔랩스 시프 슈트
        {1073034, 8880101}, // 앱솔랩스 시프 슈즈
        {1082639, 8880101}, // 앱솔랩스 시프 글러브
        {1102796, 8880101}, // 앱솔랩스 시프 케이프
        {1152178, 8880101}, // 앱솔랩스 시프 숄더

        {1004426, 8880101}, // 앱솔랩스 파이렛 페도라
        {1052890, 8880101}, // 앱솔랩스 파이렛 슈트
        {1073035, 8880101}, // 앱솔랩스 파이렛 슈즈
        {1082640, 8880101}, // 앱솔랩스 파이렛 글러브
        {1102797, 8880101}, // 앱솔랩스 파이렛 케이프
        {1152179, 8880101}, // 앱솔랩스 파이렛 숄더

        /* 루시드 */
        {2439975, 8880156}, // 홍옥의 보스 반지 상자

        {4001879, 8880156}, // 나비 날개 물방울석

        {2049100, 8880156}, // 혼돈의 주문서 60%
        {2046829, 8880156}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880156}, // 악세서리 마력 스크롤 100%

        {1012757, 8880156}, // 트와일 라이트 마크

        {1004808, 8880156}, // 아케인셰이드 나이트 햇
        {1053063, 8880156}, // 아케인셰이드 나이트 슈트
        {1073158, 8880156}, // 아케인셰이드 나이트 슈즈
        {1082695, 8880156}, // 아케인셰이드 나이트 글러브
        {1102940, 8880156}, // 아케인셰이드 나이트 케이프
        {1152196, 8880156}, // 아케인셰이드 나이트 숄더
        {1302343, 8880156}, // 아케인셰이드 세이버
        {1312203, 8880156}, // 아케인셰이드 엑스
        {1322255, 8880156}, // 아케인셰이드 해머
        {1402259, 8880156}, // 아케인셰이드 투 핸드 소드
        {1412181, 8880156}, // 아케인셰이드 투 핸드 엑스
        {1422189, 8880156}, // 아케인셰이드 투 핸드 해머
        {1432218, 8880156}, // 아케인셰이드 스피어
        {1442274, 8880156}, // 아케인셰이드 폴암
        {1542117, 8880156}, // 아케인셰이드 카타나

        {1004809, 8880156}, // 아케인셰이드 메이지 햇
        {1053064, 8880156}, // 아케인셰이드 메이지 슈트
        {1073159, 8880156}, // 아케인셰이드 메이지 슈즈
        {1082696, 8880156}, // 아케인셰이드 메이지 글러브
        {1102941, 8880156}, // 아케인셰이드 메이지 케이프
        {1152197, 8880156}, // 아케인셰이드 메이지 숄더
        {1372228, 8880156}, // 아케인셰이드 완드
        {1382265, 8880156}, // 아케인셰이드 스태프
        {1552119, 8880156}, // 아케인셰이드 채선

        {1004810, 8880156}, // 아케인셰이드 아처 햇
        {1053065, 8880156}, // 아케인셰이드 아처 슈트
        {1073160, 8880156}, // 아케인셰이드 아처 슈즈
        {1082697, 8880156}, // 아케인셰이드 아처 글러브
        {1102942, 8880156}, // 아케인셰이드 아처 케이프
        {1152198, 8880156}, // 아케인셰이드 아처 숄더
        {1452257, 8880156}, // 아케인셰이드 보우
        {1462243, 8880156}, // 아케인셰이드 크로스보우
        {1522143, 8880156}, // 아케인셰이드 듀얼 보우건

        {1004811, 8880156}, // 아케인셰이드 시프 햇
        {1053066, 8880156}, // 아케인셰이드 시프 슈트
        {1073161, 8880156}, // 아케인셰이드 시프 슈즈
        {1082698, 8880156}, // 아케인셰이드 시프 글러브
        {1102943, 8880156}, // 아케인셰이드 시프 케이프
        {1152199, 8880156}, // 아케인셰이드 시프 숄더
        {1472265, 8880156}, // 아케인셰이드 가즈
        {1332279, 8880156}, // 아케인셰이드 대거
        {1342104, 8880156}, // 아케인셰이드 블레이드
        {1362140, 8880156}, // 아케인셰이드 케인

        {1004812, 8880156}, // 아케인셰이드 파이렛 햇
        {1053067, 8880156}, // 아케인셰이드 파이렛 슈트
        {1073162, 8880156}, // 아케인셰이드 파이렛 슈즈
        {1082699, 8880156}, // 아케인셰이드 파이렛 글러브
        {1102944, 8880156}, // 아케인셰이드 파이렛 케이프
        {1152200, 8880156}, // 아케인셰이드 파이렛 숄더
        {1482221, 8880156}, // 아케인셰이드 클로
        {1492235, 8880156}, // 아케인셰이드 피스톨
        {1532150, 8880156}, // 아케인셰이드 시즈건
        {1403018, 8880156}, // 아케인셰이드 무권

        /* 윌 */
        {2439975, 8880302}, // 홍옥의 보스 반지 상자

        {4001890, 8880156}, // 코브 웹 물방울석

        {2049100, 8880302}, // 혼돈의 주문서 60%
        {2046829, 8880302}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880302}, // 악세서리 마력 스크롤 100%

        {1012757, 8880302}, // 트와일 라이트 마크

        {1004808, 8880302}, // 아케인셰이드 나이트 햇
        {1053063, 8880302}, // 아케인셰이드 나이트 슈트
        {1073158, 8880302}, // 아케인셰이드 나이트 슈즈
        {1082695, 8880302}, // 아케인셰이드 나이트 글러브
        {1102940, 8880302}, // 아케인셰이드 나이트 케이프
        {1152196, 8880302}, // 아케인셰이드 나이트 숄더
        {1302343, 8880302}, // 아케인셰이드 세이버
        {1312203, 8880302}, // 아케인셰이드 엑스
        {1322255, 8880302}, // 아케인셰이드 해머
        {1402259, 8880302}, // 아케인셰이드 투 핸드 소드
        {1412181, 8880302}, // 아케인셰이드 투 핸드 엑스
        {1422189, 8880302}, // 아케인셰이드 투 핸드 해머
        {1432218, 8880302}, // 아케인셰이드 스피어
        {1442274, 8880302}, // 아케인셰이드 폴암
        {1542117, 8880302}, // 아케인셰이드 카타나

        {1004809, 8880302}, // 아케인셰이드 메이지 햇
        {1053064, 8880302}, // 아케인셰이드 메이지 슈트
        {1073159, 8880302}, // 아케인셰이드 메이지 슈즈
        {1082696, 8880302}, // 아케인셰이드 메이지 글러브
        {1102941, 8880302}, // 아케인셰이드 메이지 케이프
        {1152197, 8880302}, // 아케인셰이드 메이지 숄더
        {1372228, 8880302}, // 아케인셰이드 완드
        {1382265, 8880302}, // 아케인셰이드 스태프
        {1552119, 8880302}, // 아케인셰이드 채선

        {1004810, 8880302}, // 아케인셰이드 아처 햇
        {1053065, 8880302}, // 아케인셰이드 아처 슈트
        {1073160, 8880302}, // 아케인셰이드 아처 슈즈
        {1082697, 8880302}, // 아케인셰이드 아처 글러브
        {1102942, 8880302}, // 아케인셰이드 아처 케이프
        {1152198, 8880302}, // 아케인셰이드 아처 숄더
        {1452257, 8880302}, // 아케인셰이드 보우
        {1462243, 8880302}, // 아케인셰이드 크로스보우
        {1522143, 8880302}, // 아케인셰이드 듀얼 보우건

        {1004811, 8880302}, // 아케인셰이드 시프 햇
        {1053066, 8880302}, // 아케인셰이드 시프 슈트
        {1073161, 8880302}, // 아케인셰이드 시프 슈즈
        {1082698, 8880302}, // 아케인셰이드 시프 글러브
        {1102943, 8880302}, // 아케인셰이드 시프 케이프
        {1152199, 8880302}, // 아케인셰이드 시프 숄더
        {1472265, 8880302}, // 아케인셰이드 가즈
        {1332279, 8880302}, // 아케인셰이드 대거
        {1342104, 8880302}, // 아케인셰이드 블레이드
        {1362140, 8880302}, // 아케인셰이드 케인

        {1004812, 8880302}, // 아케인셰이드 파이렛 햇
        {1053067, 8880302}, // 아케인셰이드 파이렛 슈트
        {1073162, 8880302}, // 아케인셰이드 파이렛 슈즈
        {1082699, 8880302}, // 아케인셰이드 파이렛 글러브
        {1102944, 8880302}, // 아케인셰이드 파이렛 케이프
        {1152200, 8880302}, // 아케인셰이드 파이렛 숄더
        {1482221, 8880302}, // 아케인셰이드 클로
        {1492235, 8880302}, // 아케인셰이드 피스톨
        {1532150, 8880302}, // 아케인셰이드 시즈건
        {1403018, 8880302}, // 아케인셰이드 무권

        /* 진 힐라 */
        {2439976, 8880405}, // 흑옥의 보스 반지 상자

        {2049100, 8880405}, // 혼돈의 주문서 60%
        {2046829, 8880405}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880405}, // 악세서리 마력 스크롤 100%
        {2046991, 8880405}, // 매지컬 한손 무기 공격력 주문서
        {2046992, 8880405}, // 매지컬 한손 무기 마력 주문서
        {2047814, 8880405}, // 매지컬 두손 무기 공격력 주문서
        {2048094, 8880405}, // 프리미엄 펫 장비 공격력 스크롤 100%
        {2048095, 8880405}, // 프리미엄 펫 장비 마력 스크롤 100%

        {1122443, 8880405}, // 데이브레이크 펜던트

        {1004808, 8880405}, // 아케인셰이드 나이트 햇
        {1053063, 8880405}, // 아케인셰이드 나이트 슈트
        {1073158, 8880405}, // 아케인셰이드 나이트 슈즈
        {1082695, 8880405}, // 아케인셰이드 나이트 글러브
        {1102940, 8880405}, // 아케인셰이드 나이트 케이프
        {1152196, 8880405}, // 아케인셰이드 나이트 숄더
        {1302343, 8880405}, // 아케인셰이드 세이버
        {1312203, 8880405}, // 아케인셰이드 엑스
        {1322255, 8880405}, // 아케인셰이드 해머
        {1402259, 8880405}, // 아케인셰이드 투 핸드 소드
        {1412181, 8880405}, // 아케인셰이드 투 핸드 엑스
        {1422189, 8880405}, // 아케인셰이드 투 핸드 해머
        {1432218, 8880405}, // 아케인셰이드 스피어
        {1442274, 8880405}, // 아케인셰이드 폴암
        {1542117, 8880405}, // 아케인셰이드 카타나

        {1004809, 8880405}, // 아케인셰이드 메이지 햇
        {1053064, 8880405}, // 아케인셰이드 메이지 슈트
        {1073159, 8880405}, // 아케인셰이드 메이지 슈즈
        {1082696, 8880405}, // 아케인셰이드 메이지 글러브
        {1102941, 8880405}, // 아케인셰이드 메이지 케이프
        {1152197, 8880405}, // 아케인셰이드 메이지 숄더
        {1372228, 8880405}, // 아케인셰이드 완드
        {1382265, 8880405}, // 아케인셰이드 스태프
        {1552119, 8880405}, // 아케인셰이드 채선

        {1004810, 8880405}, // 아케인셰이드 아처 햇
        {1053065, 8880405}, // 아케인셰이드 아처 슈트
        {1073160, 8880405}, // 아케인셰이드 아처 슈즈
        {1082697, 8880405}, // 아케인셰이드 아처 글러브
        {1102942, 8880405}, // 아케인셰이드 아처 케이프
        {1152198, 8880405}, // 아케인셰이드 아처 숄더
        {1452257, 8880405}, // 아케인셰이드 보우
        {1462243, 8880405}, // 아케인셰이드 크로스보우
        {1522143, 8880405}, // 아케인셰이드 듀얼 보우건

        {1004811, 8880405}, // 아케인셰이드 시프 햇
        {1053066, 8880405}, // 아케인셰이드 시프 슈트
        {1073161, 8880405}, // 아케인셰이드 시프 슈즈
        {1082698, 8880405}, // 아케인셰이드 시프 글러브
        {1102943, 8880405}, // 아케인셰이드 시프 케이프
        {1152199, 8880405}, // 아케인셰이드 시프 숄더
        {1472265, 8880405}, // 아케인셰이드 가즈
        {1332279, 8880405}, // 아케인셰이드 대거
        {1342104, 8880405}, // 아케인셰이드 블레이드
        {1362140, 8880405}, // 아케인셰이드 케인

        {1004812, 8880405}, // 아케인셰이드 파이렛 햇
        {1053067, 8880405}, // 아케인셰이드 파이렛 슈트
        {1073162, 8880405}, // 아케인셰이드 파이렛 슈즈
        {1082699, 8880405}, // 아케인셰이드 파이렛 글러브
        {1102944, 8880405}, // 아케인셰이드 파이렛 케이프
        {1152200, 8880405}, // 아케인셰이드 파이렛 숄더
        {1482221, 8880405}, // 아케인셰이드 클로
        {1492235, 8880405}, // 아케인셰이드 피스톨
        {1532150, 8880405}, // 아케인셰이드 시즈건
        {1403018, 8880405}, // 아케인셰이드 무권

        /* 듄켈 */
        {2439976, 8645009}, // 흑옥의 보스 반지 상자

        {2049100, 8645009}, // 혼돈의 주문서 60%
        {2046829, 8645009}, // 악세서리 공격력 스크롤 100%
        {2046830, 8645009}, // 악세서리 마력 스크롤 100%
        {2046991, 8645009}, // 매지컬 한손 무기 공격력 주문서
        {2046992, 8645009}, // 매지컬 한손 무기 마력 주문서
        {2047814, 8645009}, // 매지컬 두손 무기 공격력 주문서
        {2048094, 8645009}, // 프리미엄 펫 장비 공격력 스크롤 100%
        {2048095, 8645009}, // 프리미엄 펫 장비 마력 스크롤 100%

        {1032330, 8645009}, // 에스텔라 이어링

        {1004808, 8645009}, // 아케인셰이드 나이트 햇
        {1053063, 8645009}, // 아케인셰이드 나이트 슈트
        {1073158, 8645009}, // 아케인셰이드 나이트 슈즈
        {1082695, 8645009}, // 아케인셰이드 나이트 글러브
        {1102940, 8645009}, // 아케인셰이드 나이트 케이프
        {1152196, 8645009}, // 아케인셰이드 나이트 숄더
        {1302343, 8645009}, // 아케인셰이드 세이버
        {1312203, 8645009}, // 아케인셰이드 엑스
        {1322255, 8645009}, // 아케인셰이드 해머
        {1402259, 8645009}, // 아케인셰이드 투 핸드 소드
        {1412181, 8645009}, // 아케인셰이드 투 핸드 엑스
        {1422189, 8645009}, // 아케인셰이드 투 핸드 해머
        {1432218, 8645009}, // 아케인셰이드 스피어
        {1442274, 8645009}, // 아케인셰이드 폴암
        {1542117, 8645009}, // 아케인셰이드 카타나

        {1004809, 8645009}, // 아케인셰이드 메이지 햇
        {1053064, 8645009}, // 아케인셰이드 메이지 슈트
        {1073159, 8645009}, // 아케인셰이드 메이지 슈즈
        {1082696, 8645009}, // 아케인셰이드 메이지 글러브
        {1102941, 8645009}, // 아케인셰이드 메이지 케이프
        {1152197, 8645009}, // 아케인셰이드 메이지 숄더
        {1372228, 8645009}, // 아케인셰이드 완드
        {1382265, 8645009}, // 아케인셰이드 스태프
        {1552119, 8645009}, // 아케인셰이드 채선

        {1004810, 8645009}, // 아케인셰이드 아처 햇
        {1053065, 8645009}, // 아케인셰이드 아처 슈트
        {1073160, 8645009}, // 아케인셰이드 아처 슈즈
        {1082697, 8645009}, // 아케인셰이드 아처 글러브
        {1102942, 8645009}, // 아케인셰이드 아처 케이프
        {1152198, 8645009}, // 아케인셰이드 아처 숄더
        {1452257, 8645009}, // 아케인셰이드 보우
        {1462243, 8645009}, // 아케인셰이드 크로스보우
        {1522143, 8645009}, // 아케인셰이드 듀얼 보우건

        {1004811, 8645009}, // 아케인셰이드 시프 햇
        {1053066, 8645009}, // 아케인셰이드 시프 슈트
        {1073161, 8645009}, // 아케인셰이드 시프 슈즈
        {1082698, 8645009}, // 아케인셰이드 시프 글러브
        {1102943, 8645009}, // 아케인셰이드 시프 케이프
        {1152199, 8645009}, // 아케인셰이드 시프 숄더
        {1472265, 8645009}, // 아케인셰이드 가즈
        {1332279, 8645009}, // 아케인셰이드 대거
        {1342104, 8645009}, // 아케인셰이드 블레이드
        {1362140, 8645009}, // 아케인셰이드 케인

        {1004812, 8645009}, // 아케인셰이드 파이렛 햇
        {1053067, 8645009}, // 아케인셰이드 파이렛 슈트
        {1073162, 8645009}, // 아케인셰이드 파이렛 슈즈
        {1082699, 8645009}, // 아케인셰이드 파이렛 글러브
        {1102944, 8645009}, // 아케인셰이드 파이렛 케이프
        {1152200, 8645009}, // 아케인셰이드 파이렛 숄더
        {1482221, 8645009}, // 아케인셰이드 클로
        {1492235, 8645009}, // 아케인셰이드 피스톨
        {1532150, 8645009}, // 아케인셰이드 시즈건
        {1403018, 8645009}, // 아케인셰이드 무권

        /* 검은 마법사 */
        {2439977, 8880518}, // 백옥의 보스 반지 상자

        {2049100, 8880518}, // 혼돈의 주문서 60%
        {2046829, 8880518}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880518}, // 악세서리 마력 스크롤 100%
        {2046991, 8880518}, // 매지컬 한손 무기 공격력 주문서
        {2046992, 8880518}, // 매지컬 한손 무기 마력 주문서
        {2047814, 8880518}, // 매지컬 두손 무기 공격력 주문서
        {2048094, 8880518}, // 프리미엄 펫 장비 공격력 스크롤 100%
        {2048095, 8880518}, // 프리미엄 펫 장비 마력 스크롤 100%

        {1032330, 8880518}, // 에스텔라 이어링

        {1004808, 8880518}, // 아케인셰이드 나이트 햇
        {1053063, 8880518}, // 아케인셰이드 나이트 슈트
        {1073158, 8880518}, // 아케인셰이드 나이트 슈즈
        {1082695, 8880518}, // 아케인셰이드 나이트 글러브
        {1102940, 8880518}, // 아케인셰이드 나이트 케이프
        {1152196, 8880518}, // 아케인셰이드 나이트 숄더
        {1302343, 8880518}, // 아케인셰이드 세이버
        {1312203, 8880518}, // 아케인셰이드 엑스
        {1322255, 8880518}, // 아케인셰이드 해머
        {1402259, 8880518}, // 아케인셰이드 투 핸드 소드
        {1412181, 8880518}, // 아케인셰이드 투 핸드 엑스
        {1422189, 8880518}, // 아케인셰이드 투 핸드 해머
        {1432218, 8880518}, // 아케인셰이드 스피어
        {1442274, 8880518}, // 아케인셰이드 폴암
        {1542117, 8880518}, // 아케인셰이드 카타나

        {1004809, 8880518}, // 아케인셰이드 메이지 햇
        {1053064, 8880518}, // 아케인셰이드 메이지 슈트
        {1073159, 8880518}, // 아케인셰이드 메이지 슈즈
        {1082696, 8880518}, // 아케인셰이드 메이지 글러브
        {1102941, 8880518}, // 아케인셰이드 메이지 케이프
        {1152197, 8880518}, // 아케인셰이드 메이지 숄더
        {1372228, 8880518}, // 아케인셰이드 완드
        {1382265, 8880518}, // 아케인셰이드 스태프
        {1552119, 8880518}, // 아케인셰이드 채선

        {1004810, 8880518}, // 아케인셰이드 아처 햇
        {1053065, 8880518}, // 아케인셰이드 아처 슈트
        {1073160, 8880518}, // 아케인셰이드 아처 슈즈
        {1082697, 8880518}, // 아케인셰이드 아처 글러브
        {1102942, 8880518}, // 아케인셰이드 아처 케이프
        {1152198, 8880518}, // 아케인셰이드 아처 숄더
        {1452257, 8880518}, // 아케인셰이드 보우
        {1462243, 8880518}, // 아케인셰이드 크로스보우
        {1522143, 8880518}, // 아케인셰이드 듀얼 보우건

        {1004811, 8880518}, // 아케인셰이드 시프 햇
        {1053066, 8880518}, // 아케인셰이드 시프 슈트
        {1073161, 8880518}, // 아케인셰이드 시프 슈즈
        {1082698, 8880518}, // 아케인셰이드 시프 글러브
        {1102943, 8880518}, // 아케인셰이드 시프 케이프
        {1152199, 8880518}, // 아케인셰이드 시프 숄더
        {1472265, 8880518}, // 아케인셰이드 가즈
        {1332279, 8880518}, // 아케인셰이드 대거
        {1342104, 8880518}, // 아케인셰이드 블레이드
        {1362140, 8880518}, // 아케인셰이드 케인

        {1004812, 8880518}, // 아케인셰이드 파이렛 햇
        {1053067, 8880518}, // 아케인셰이드 파이렛 슈트
        {1073162, 8880518}, // 아케인셰이드 파이렛 슈즈
        {1082699, 8880518}, // 아케인셰이드 파이렛 글러브
        {1102944, 8880518}, // 아케인셰이드 파이렛 케이프
        {1152200, 8880518}, // 아케인셰이드 파이렛 숄더
        {1482221, 8880518}, // 아케인셰이드 클로
        {1492235, 8880518}, // 아케인셰이드 피스톨
        {1532150, 8880518}, // 아케인셰이드 시즈건
        {1403018, 8880518}, // 아케인셰이드 무권

        /* 모리 란 마루 */
        {2049100, 9421586}, // 혼돈의 주문서 60%
        {2046829, 9421586}, // 악세서리 공격력 스크롤 100%
        {2046830, 9421586}, // 악세서리 마력 스크롤 100%

        {1132156, 9421586}, // 
        {1132157, 9421586}, // 
        {1132158, 9421586}, // 
        {1132159, 9421586}, // 
        {1132160, 9421586}, // 

        {1003601, 9421586}, // 
        {1003602, 9421586}, // 
        {1003603, 9421586}, // 
        {1003604, 9421586}, // 
        {1003605, 9421586}, // 

        {1102456, 9421586}, // 
        {1102457, 9421586}, // 
        {1102458, 9421586}, // 
        {1102459, 9421586}, // 
        {1102460, 9421586}, // 

        {1082472, 9421586}, // 
        {1082473, 9421586}, // 
        {1082474, 9421586}, // 
        {1082475, 9421586}, // 
        {1082476, 9421586}, // 

        {1052509, 9421586}, // 
        {1052510, 9421586}, // 
        {1052511, 9421586}, // 
        {1052512, 9421586}, // 
        {1052513, 9421586}, // 

        {1072711, 9421586}, // 
        {1072712, 9421586}, // 
        {1072713, 9421586}, // 
        {1072714, 9421586}, // 
        {1072715, 9421586}, // 

        /* 노히메 */
        {2049100, 9450066}, // 혼돈의 주문서 60%
        {2046829, 9450066}, // 악세서리 공격력 스크롤 100%
        {2046830, 9450066}, // 악세서리 마력 스크롤 100%

        {1132156, 9450066}, // 
        {1132157, 9450066}, // 
        {1132158, 9450066}, // 
        {1132159, 9450066}, // 
        {1132160, 9450066}, // 

        {1003601, 9450066}, // 
        {1003602, 9450066}, // 
        {1003603, 9450066}, // 
        {1003604, 9450066}, // 
        {1003605, 9450066}, // 

        {1102456, 9450066}, // 
        {1102457, 9450066}, // 
        {1102458, 9450066}, // 
        {1102459, 9450066}, // 
        {1102460, 9450066}, // 

        {1082472, 9450066}, // 
        {1082473, 9450066}, // 
        {1082474, 9450066}, // 
        {1082475, 9450066}, // 
        {1082476, 9450066}, // 

        {1052509, 9450066}, // 
        {1052510, 9450066}, // 
        {1052511, 9450066}, // 
        {1052512, 9450066}, // 
        {1052513, 9450066}, // 

        {1072711, 9450066}, // 
        {1072712, 9450066}, // 
        {1072713, 9450066}, // 
        {1072714, 9450066}, // 
        {1072715, 9450066}, // 

        /* 아케치 미츠히데 */
        {2049100, 9601511}, // 혼돈의 주문서 60%
        {2046829, 9601511}, // 악세서리 공격력 스크롤 100%
        {2046830, 9601511}, // 악세서리 마력 스크롤 100%
        {2046991, 9601511}, // 매지컬 한손 무기 공격력 주문서
        {2046992, 9601511}, // 매지컬 한손 무기 마력 주문서
        {2047814, 9601511}, // 매지컬 두손 무기 공격력 주문서
        {2048094, 9601511}, // 프리미엄 펫 장비 공격력 스크롤 100%
        {2048095, 9601511}, // 프리미엄 펫 장비 마력 스크롤 100%

        {1132156, 9601511}, // 
        {1132157, 9601511}, // 
        {1132158, 9601511}, // 
        {1132159, 9601511}, // 
        {1132160, 9601511}, // 

        {1003601, 9601511}, // 
        {1003602, 9601511}, // 
        {1003603, 9601511}, // 
        {1003604, 9601511}, // 
        {1003605, 9601511}, // 

        {1102456, 9601511}, // 
        {1102457, 9601511}, // 
        {1102458, 9601511}, // 
        {1102459, 9601511}, // 
        {1102460, 9601511}, // 

        {1082472, 9601511}, // 
        {1082473, 9601511}, // 
        {1082474, 9601511}, // 
        {1082475, 9601511}, // 
        {1082476, 9601511}, // 

        {1052509, 9601511}, // 
        {1052510, 9601511}, // 
        {1052511, 9601511}, // 
        {1052512, 9601511}, // 
        {1052513, 9601511}, // 

        {1072711, 9601511}, // 
        {1072712, 9601511}, // 
        {1072713, 9601511}, // 
        {1072714, 9601511}, // 
        {1072715, 9601511}, // 

        {1302229, 9601511}, // 
        {1312118, 9601511}, // 
        {1322164, 9601511}, // 
        {1402153, 9601511}, // 
        {1412106, 9601511}, // 
        {1422109, 9601511}, // 
        {1432140, 9601511}, // 
        {1442184, 9601511}, // 
        {1452172, 9601511}, // 
        {1462161, 9601511}, // 
        {1372141, 9601511}, // 
        {1382170, 9601511}, // 
        {1332195, 9601511}, // 
        {1472181, 9601511}, // 
        {1342071, 9601511}, // 
        {1482142, 9601511}, // 
        {1492154, 9601511}, // 

        /* 감시자 칼로스 */
        {2439977, 8880808}, // 백옥의 보스 반지 상자

        {2049100, 8880808}, // 혼돈의 주문서 60%
        {2046829, 8880808}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880808}, // 악세서리 마력 스크롤 100%
        {2046991, 8880808}, // 매지컬 한손 무기 공격력 주문서
        {2046992, 8880808}, // 매지컬 한손 무기 마력 주문서
        {2047814, 8880808}, // 매지컬 두손 무기 공격력 주문서
        {2048094, 8880808}, // 프리미엄 펫 장비 공격력 스크롤 100%
        {2048095, 8880808}, // 프리미엄 펫 장비 마력 스크롤 100%

        {1005980, 8880808}, // 에테르넬 나이트 헬름
        {1005981, 8880808}, // 에테르넬 메이지 햇
        {1005982, 8880808}, // 에테르넬 아처 햇
        {1005983, 8880808}, // 에테르넬 시프 반다나
        {1005984, 8880808}, // 에테르넬 파이렛 햇

        {1042433, 8880808}, // 에테르넬 나이트 아머
        {1042434, 8880808}, // 에테르넬 메이지 로브
        {1042435, 8880808}, // 에테르넬 아처 후드
        {1042436, 8880808}, // 에테르넬 시프 셔츠
        {1042437, 8880808}, // 에테르넬 파이렛 코트

        {1062285, 8880808}, // 에테르넬 나이트 팬츠
        {1062286, 8880808}, // 에테르넬 메이지 팬츠
        {1062287, 8880808}, // 에테르넬 아처 팬츠
        {1062288, 8880808}, // 에테르넬 시프 팬츠
        {1062289, 8880808}, // 에테르넬 파이렛 팬츠

        /* 카링 */
        {2439977, 8880845}, // 백옥의 보스 반지 상자

        {2049100, 8880845}, // 혼돈의 주문서 60%
        {2046829, 8880845}, // 악세서리 공격력 스크롤 100%
        {2046830, 8880845}, // 악세서리 마력 스크롤 100%
        {2046991, 8880845}, // 매지컬 한손 무기 공격력 주문서
        {2046992, 8880845}, // 매지컬 한손 무기 마력 주문서
        {2047814, 8880845}, // 매지컬 두손 무기 공격력 주문서
        {2048094, 8880845}, // 프리미엄 펫 장비 공격력 스크롤 100%
        {2048095, 8880845}, // 프리미엄 펫 장비 마력 스크롤 100%

        {1005980, 8880845}, // 에테르넬 나이트 헬름
        {1005981, 8880845}, // 에테르넬 메이지 햇
        {1005982, 8880845}, // 에테르넬 아처 햇
        {1005983, 8880845}, // 에테르넬 시프 반다나
        {1005984, 8880845}, // 에테르넬 파이렛 햇

        {1042433, 8880845}, // 에테르넬 나이트 아머
        {1042434, 8880845}, // 에테르넬 메이지 로브
        {1042435, 8880845}, // 에테르넬 아처 후드
        {1042436, 8880845}, // 에테르넬 시프 셔츠
        {1042437, 8880845}, // 에테르넬 파이렛 코트

        {1062285, 8880845}, // 에테르넬 나이트 팬츠
        {1062286, 8880845}, // 에테르넬 메이지 팬츠
        {1062287, 8880845}, // 에테르넬 아처 팬츠
        {1062288, 8880845}, // 에테르넬 시프 팬츠
        {1062289, 8880845}, // 에테르넬 파이렛 팬츠

        {1152212, 8880845}, // 에테르넬 나이트 숄더
        {1152213, 8880845}, // 에테르넬 메이지 숄더
        {1152214, 8880845}, // 에테르넬 아처 숄더
        {1152215, 8880845}, // 에테르넬 시프 숄더
        {1152216, 8880845}, // 에테르넬 파이렛 숄더
    };

    public static DropBoss getInstace() {
        if (instance == null) {
            instance = new DropBoss();
        }
        return instance;
    }
}
