var cItem = [

2000004, // 엘릭서
2000005, // 파워 엘릭서
5062002, // 마스터 미라클 큐브

2049300, // 고급 장비 강화 주문서

1112400, // 연금술사의 반지

2040012, // 투구 지력 주문서 70%
2040028, // 투구 민첩 주문서 70%
2040304, // 귀 장식 지력 주문서 70%
2040306, // 귀 장식 민첩 주문서 70%
2040320, // 귀 장식 행운 주문서 70%
2040406, // 상의 힘 주문서 70%
2040424, // 상의 행운 주문서 70%
2040508, // 전신 갑옷 민첩 주문서 70%
2040518, // 전신 갑옷 지력 주문서 70%
2040520, // 전신 갑옷 행운 주문서 70%
2040531, // 전신 갑옷 힘 주문서 70%
2040624, // 하의 민첩 주문서 70%
2040712, // 신발 민첩 주문서 70%
2040714, // 신발 점프력 주문서 70%
2040716, // 신발 이동 속도 주문서 70%
2040810, // 장갑 공격력 주문서 70%
2040904, // 방패 방어력 주문서 70%
2040906, // 방패 행운 주문서 70%
2040930, // 방패 힘 주문서 70%
2041034, // 망토 힘 주문서 70%
2041036, // 망토 지력 주문서 70%
2041038, // 망토 민첩 주문서 70%
2041040, // 망토 행운 주문서 70%
2041112, // 반지 힘 주문서 70%
2041114, // 방지 지력 주문서 70%
2041116, // 반지 민첩 주문서 70%
2041118, // 반지 행운 주문서 70%
2041312, // 벨트 힘 주문서 70%
2041314, // 벨트 지력 주문서 70%
2041316, // 벨트 민첩 주문서 70%
2041318, // 벨트 행운 주문서 70%
2043004, // 한손 검 공격력 주문서 70%
2043104, // 한손 도끼 공격력 주문서 70%
2043204, // 한손 둔기 공격력 주문서 70%
2043304, // 단검 공격력 주문서 70%
2043603, // 케인 공격력 주문서 70%
2043704, // 완드 마력 주문서 70%
2043804, // 스태프 마력 주문서 70%
2044004, // 두손 검 공격력 주문서 70%
2044104, // 두손 도끼 공격력 주문서 70%
2044204, // 두손 둔기 공격력 주문서 70%
2044304, // 창 공격력 주문서 70%
2044404, // 폴암 공격력 주문서 70%
2044504, // 활 공격력 주문서 70%
2044604, // 석궁 공격력 주문서 70%
2044704, // 아대 공격력 주문서 70%
2044803, // 너클 공격력 주문서 70%
2044903, // 건 공격력 주문서 70%
2045203, // 듀얼 보우 건 공격력 주문서 70%
2045303, // 핸드 캐논 공격력 주문서 70%
2040013, // 투구 지력 주문서 30%
2040030, // 투구 민첩 주문서 30%
2040305, // 귀 장식 지력 주문서 30%
2040307, // 귀 장식 민첩 주문서 30%
2040322, // 귀 장식 행운 주문서 30%
2040407, // 상의 힘 주문서 30%
2040426, // 상의 행운 주문서 30%
2040509, // 전신 갑옷 민첩 주문서 30%
2040519, // 전신 갑옷 지력 주문서 30%
2040521, // 전신 갑옷 행운 주문서 30%
2040532, // 전신 갑옷 힘 주문서 30%
2040626, // 하의 민첩 주문서 30%
2040713, // 신발 민첩 주문서 30%
2040715, // 신발 점프력 주문서 30%
2040717, // 신발 이동 속도 주문서 30%
2040811, // 장갑 공격력 주문서 30%
2040907, // 방패 행운 주문서 30%
2040909, // 방패 체력 주문서 30%
2040932, // 방패 힘 주문서 30%
2041035, // 망토 힘 주문서 30%
2041037, // 망토 지력 주문서 30%
2041039, // 망토 민첩 주문서 30%
2041041, // 망토 행운 주문서 30%
2041113, // 반지 힘 주문서 30%
2041115, // 방지 지력 주문서 30%
2041117, // 반지 민첩 주문서 30%
2041119, // 반지 행운 주문서 30%
2041313, // 벨트 힘 주문서 30%
2041315, // 벨트 지력 주문서 30%
2041317, // 벨트 민첩 주문서 30%
2041319, // 벨트 행운 주문서 30%
2043005, // 한손 검 공격력 주문서 30%
2043105, // 한손 도끼 공격력 주문서 30%
2043205, // 한손 둔기 공격력 주문서 30%
2043305, // 단검 공격력 주문서 30%
2043604, // 케인 공격력 주문서 30%
2043705, // 완드 마력 주문서 30%
2043805, // 스태프 마력 주문서 30%
2044005, // 두손 검 공격력 주문서 30%
2044105, // 두손 도끼 공격력 주문서 30%
2044205, // 두손 둔기 공격력 주문서 30%
2044305, // 창 공격력 주문서 30%
2044405, // 폴암 공격력 주문서 30%
2044505, // 활 공격력 주문서 30%
2044605, // 석궁 공격력 주문서 30%
2044705, // 아대 공격력 주문서 30%
2044804, // 너클 공격력 주문서 30%
2044904, // 건 공격력 주문서 30%
2045204, // 듀얼 보우 건 공격력 주문서 30%
2045304, // 핸드 캐논 공격력 주문서 30%
];

function run() {
    var r0 = Packages.server.Randomizer.nextInt(999);
    var r1 = Packages.server.Randomizer.rand(0, 100);
    var r2 = Packages.server.Randomizer.rand(1, 100);
    var r3 = Packages.server.Randomizer.nextInt(cItem.length - 1);
    var itemID = cItem[r3];
    var quantity = 1;
    if (itemID == 2000004 || itemID == 2000005) {
        quantity = Packages.server.Randomizer.rand(10, 50);
    }
    if (itemID == 5062002) {
        quantity = Packages.server.Randomizer.rand(5, 10);
    }
    if (r0 < 5) {
        itemID = 2070023; // 플레임 표창
    }
    if (r0 < 4) {
        itemID = 1112663; // 화이트 엔젤릭 블레스
    }
    if (r0 < 2) {
        itemID = 2049700; // 에픽 잠재 능력 부여 주문서
    }
    if (r0 < 1) {
        itemID = 1142249; // 나는야 럭키 가이 ★
    }
    if (itemID == 1142249 || itemID == 1112663) {
        Packages.handling.world.World.Broadcast.broadcastMessage(Packages.tools.packet.CWvsContext.serverNotice(6, itemID, cm.getPlayer().getName() + "님께서 프리미엄 부화기에서 " + "[{" + Packages.server.MapleItemInformationProvider.getInstance().getItemInformation(itemID).name + "}]" + " 1개를 획득하였습니다.", false));
    }
    return r1 + "," + r2 + "," + itemID + "," + quantity;
}