var cItem = [

2000004, // 엘릭서
2000005, // 파워 엘릭서
5062000, // 미라클 큐브

2049300, // 고급 장비 강화 주문서

2040025, // 투구 지력 주문서 60%
2040029, // 투구 민첩 주문서 60%
2040301, // 귀 장식 지력 주문서 60%
2040317, // 귀 장식 민첩 주문서 60%
2040321, // 귀 장식 행운 주문서 60%
2040418, // 상의 힘 주문서 60%
2040425, // 상의 행운 주문서 60%
2040501, // 전신 갑옷 민첩 주문서 60%
2040513, // 전신 갑옷 지력 주문서 60%
2040516, // 전신 갑옷 행운 주문서 60%
2040532, // 전신 갑옷 힘 주문서 60%
2040625, // 하의 민첩 주문서 60%
2040704, // 신발 점프력 주문서 60%
2040707, // 신발 이동속도 주문서 60%
2040804, // 장갑 공격력 주문서 60%
2040924, // 방패 행운 주문서 60%
2040931, // 방패 힘 주문서 60%
2041013, // 망토 힘 주문서 60%
2041016, // 망토 지력 주문서 60%
2041019, // 망토 민첩 주문서 60%
2041022, // 망토 행운 주문서 60%
2041101, // 반지 힘 주문서 60%
2041104, // 반지 지력 주문서 60%
2041107, // 반지 민첩 주문서 60%
2041110, // 반지 행운 주문서 60%
2041301, // 벨트 힘 주문서 60%
2041304, // 벨트 지력 주문서 60%
2041307, // 벨트 민첩 주문서 60%
2041310, // 벨트 행운 주문서 60%
2043001, // 한손 검 공격력 주문서 60%
2043101, // 한손 도끼 공격력 주문서 60%
2043201, // 한손 둔기 공격력 주문서 60%
2043301, // 단검 공격력 주문서 60%
2043401, // 블레이드 공격력 주문서 60%
2043601, // 케인 공격력 주문서 60%
2043701, // 완드 마력 주문서 60%
2043801, // 스태프 마력 주문서 60%
2044001, // 두손 검 공격력 주문서 60%
2044101, // 두손 도끼 공격력 주문서 60%
2044201, // 두손 둔기 공격력 주문서 60%
2044301, // 창 공격력 주문서 60%
2044401, // 폴암 공격력 주문서 60%
2044501, // 활 공격력 주문서 60%
2044601, // 석궁 공격력 주문서 60%
2044701, // 아대 공격력 주문서 60%
2044801, // 너클 공격력 주문서 60%
2044901, // 건 공격력 주문서 60%
2045201, // 듀얼 보우 건 공격력 주문서 60%
2045301, // 핸드 캐논 공격력 주문서 60%
2040026, // 투구 지력 주문서 10%
2040031, // 투구 민첩 주문서 10%
2040302, // 귀 장식 지력 주문서 10%
2040318, // 귀 장식 민첩 주문서 10%
2040323, // 귀 장식 행운 주문서 10%
2040419, // 상의 힘 주문서 10%
2040427, // 상의 행운 주문서 10%
2040502, // 전신 갑옷 민첩 주문서 10%
2040514, // 전신 갑옷 지력 주문서 10%
2040517, // 전신 갑옷 행운 주문서 10%
2040534, // 전신 갑옷 힘 주문서 10%
2040627, // 하의 민첩 주문서 10%
2040705, // 신발 점프력 주문서 10%
2040708, // 신발 이동속도 주문서 10%
2040805, // 장갑 공격력 주문서 10%
2040925, // 방패 행운 주문서 10%
2040933, // 방패 힘 주문서 10%
2041014, // 망토 힘 주문서 10%
2041017, // 망토 지력 주문서 10%
2041020, // 망토 민첩 주문서 10%
2041023, // 망토 행운 주문서 10%
2041102, // 반지 힘 주문서 10%
2041105, // 반지 지력 주문서 10%
2041108, // 반지 민첩 주문서 10%
2041111, // 반지 행운 주문서 10%
2041302, // 벨트 힘 주문서 10%
2041305, // 벨트 지력 주문서 10%
2041308, // 벨트 민첩 주문서 10%
2041311, // 벨트 행운 주문서 10%
2043002, // 한손 검 공격력 주문서 10%
2043102, // 한손 도끼 공격력 주문서 10%
2043202, // 한손 둔기 공격력 주문서 10%
2043302, // 단검 공격력 주문서 10%
2043402, // 블레이드 공격력 주문서 10%
2043602, // 케인 공격력 주문서 10%
2043702, // 완드 마력 주문서 10%
2043802, // 스태프 마력 주문서 10%
2044002, // 두손 검 공격력 주문서 10%
2044102, // 두손 도끼 공격력 주문서 10%
2044202, // 두손 둔기 공격력 주문서 10%
2044302, // 창 공격력 주문서 10%
2044402, // 폴암 공격력 주문서 10%
2044502, // 활 공격력 주문서 10%
2044602, // 석궁 공격력 주문서 10%
2044702, // 아대 공격력 주문서 10%
2044802, // 너클 공격력 주문서 10%
2044902, // 건 공격력 주문서 10%
2045202, // 듀얼 보우 건 공격력 주문서 10%
2045302, // 핸드 캐논 공격력 주문서 10%
2040233, // 눈 장식 힘 주문서 60%
2040234, // 눈 장식 민첩 주문서 60%
2040235, // 눈 장식 지력 주문서 60%
2040236, // 눈 장식 행운 주문서 60%
2040845, // 장갑 마력 주문서 60%
2045401, // 카타나 공격력 주문서 60%
2045402, // 카타나 공격력 주문서 10%
2045501, // 부채 마력 주문서 60%
2045502, // 부채 마력 주문서 10%
1442039, // 냉동 참치
1372033, // 하트 완드
1302049, // 광선 채찍
1302063, // 화염의 카타나
];

function run() {
    var r0 = Packages.server.Randomizer.nextInt(999);
    var r1 = Packages.server.Randomizer.rand(0, 100);
    var r2 = Packages.server.Randomizer.rand(1, 100);
    var r3 = Packages.server.Randomizer.nextInt(cItem.length - 1);
    var itemID = cItem[r3];
    if (r0 < 5) {
        itemID = 2070024; // 무한의 수리검
    }
    if (r0 < 2) {
        itemID = 1112586; // 다크 엔젤릭 블레스 링
    }
    if (r0 < 1) {
        itemID = 2049700; // 에픽 잠재 능력 부여 주문서
    }
    var quantity = 1;
    if (itemID == 2000004 || itemID == 2000005) {
        quantity = Packages.server.Randomizer.rand(10, 50);
    }
    if (itemID == 5062000) {
        quantity = Packages.server.Randomizer.rand(10, 20);
    }
    if (itemID == 1112586) {
        Packages.handling.world.World.Broadcast.broadcastMessage(Packages.tools.packet.CWvsContext.serverNotice(6, itemID, cm.getPlayer().getName() + "님께서 프리미엄 부화기에서 " + "[{" + Packages.server.MapleItemInformationProvider.getInstance().getItemInformation(itemID).name + "}]" + " 1개를 획득하였습니다.", false));
    }
    return r1 + "," + r2 + "," + itemID + "," + quantity;
}