var cItem = [
2000004, // 엘릭서
2000005, // 파워 엘릭서
2040008, // 투구 방어력 주문서 70%
2040010, // 투구 체력 주문서 70%
2040012, // 투구 지력 주문서 70%
2040028, // 투구 민첩 주문서 70%
2040304, // 귀 장식 지력 주문서 70%
2040306, // 귀 장식 민첩 주문서 70%
2040320, // 귀 장식 행운 주문서 70%
2040325, // 귀 장식 체력 주문서 70%
2040404, // 상의 방어력 주문서 70%
2040406, // 상의 힘 주문서 70%
2040408, // 상의 체력 주문서 70%
2040424, // 상의 행운 주문서 70%
2040508, // 전신 갑옷 민첩 주문서 70%
2040510, // 전신 갑옷 방어력 주문서 70%
2040518, // 전신 갑옷 지력 주문서 70%
2040520, // 전신 갑옷 행운 주문서 70%
2040531, // 전신 갑옷 힘 주문서 70%
2040604, // 하의 방어력 주문서 70%
2040606, // 하의 점프 주문서 70%
2040608, // 하의 체력 주문서 70%
2040624, // 하의 민첩 주문서 70%
2040712, // 신발 민첩 주문서 70%
2040714, // 신발 점프력 주문서 70%
2040716, // 신발 이동 속도 주문서 70%
2040808, // 장갑 민첩 주문서 70%
2040810, // 장갑 공격력 주문서 70%
2040812, // 장갑 체력 주문서 70%
2040904, // 방패 방어력 주문서 70%
2040906, // 방패 행운 주문서 70%
2040908, // 방패 체력 주문서 70%
2040930, // 방패 힘 주문서 70%
2041026, // 망토 마법 방어력 주문서 70%
2041028, // 망토 물리 방어력 주문서 70%
2041030, // 망토 체력 주문서 70%
2041032, // 망토 마나 주문서 70%
2041034, // 망토 힘 주문서 70%
2041036, // 망토 지력 주문서 70%
2041038, // 망토 민첩 주문서 70%
2041040, // 망토 행운 주문서 70%
2041112, // 반지 힘 주문서 70%
2041114, // 방지 지력 주문서 70%
2041116, // 반지 민첩 주문서 70%
2041118, // 반지 행운 주문서 70%
2041312, // 벨트 힘 주문서 70%
2041314, // 벨트 지력 주문서 70%
2041316, // 벨트 민첩 주문서 70%
2041318, // 벨트 행운 주문서 70%
2043004, // 한손 검 공격력 주문서 70%
2043016, // 한손 검 명중치 주문서 70%
2043104, // 한손 도끼 공격력 주문서 70%
2043204, // 한손 둔기 공격력 주문서 70%
2043211, // 한손 둔기 명중치 주문서 70%
2043304, // 단검 공격력 주문서 70%
2043603, // 케인 공격력 주문서 70%
2043704, // 완드 마력 주문서 70%
2043804, // 스태프 마력 주문서 70%
2044004, // 두손 검 공격력 주문서 70%
2044011, // 두손 검 명중치 주문서 70%
2044104, // 두손 도끼 공격력 주문서 70%
2044111, // 두손 도끼 명중치 주문서 70%
2044204, // 두손 둔기 공격력 주문서 70%
2044211, // 두손 둔기 명중치 주문서 70%
2044304, // 창 공격력 주문서 70%
2044311, // 창 명중치 주문서 70%
2044404, // 폴암 공격력 주문서 70%
2044411, // 폴암 명중치 주문서 70%
2044504, // 활 공격력 주문서 70%
2044604, // 석궁 공격력 주문서 70%
2044704, // 아대 공격력 주문서 70%
2044803, // 너클 공격력 주문서 70%
2044806, // 너클 명중치 주문서 70%
2044903, // 건 공격력 주문서 70%
2040009, // 투구 방어력 주문서 30%
2040011, // 투구 체력 주문서 30%
2040013, // 투구 지력 주문서 30%
2040030, // 투구 민첩 주문서 30%
2040305, // 귀 장식 지력 주문서 30%
2040307, // 귀 장식 민첩 주문서 30%
2040322, // 귀 장식 행운 주문서 30%
2040327, // 귀 장식 체력 주문서 30%
2040405, // 상의 방어력 주문서 30%
2040407, // 상의 힘 주문서 30%
2040409, // 상의 체력 주문서 30%
2040426, // 상의 행운 주문서 30%
2040509, // 전신 갑옷 민첩 주문서 30%
2040511, // 전신 갑옷 방어력 주문서 30%
2040519, // 전신 갑옷 지력 주문서 30%
2040521, // 전신 갑옷 행운 주문서 30%
2040532, // 전신 갑옷 힘 주문서 30%
2040605, // 하의 방어력 주문서 30%
2040607, // 하의 점프 주문서 30%
2040609, // 하의 체력 주문서 30%
2040626, // 하의 민첩 주문서 30%
2040713, // 신발 민첩 주문서 30%
2040715, // 신발 점프력 주문서 30%
2040717, // 신발 이동 속도 주문서 30%
2040809, // 장갑 민첩 주문서 30%
2040811, // 장갑 공격력 주문서 30%
2040813, // 장갑 체력 주문서 30%
2040905, // 방패 방어력 주문서 30%
2040907, // 방패 행운 주문서 30%
2040909, // 방패 체력 주문서 30%
2040932, // 방패 힘 주문서 30%
2041027, // 망토 마법 방어력 주문서 30%
2041029, // 망토 물리 방어력 주문서 30%
2041031, // 망토 체력 주문서 30%
2041033, // 망토 마나 주문서 30%
2041035, // 망토 힘 주문서 30%
2041037, // 망토 지력 주문서 30%
2041039, // 망토 민첩 주문서 30%
2041041, // 망토 행운 주문서 30%
2041113, // 반지 힘 주문서 30%
2041115, // 방지 지력 주문서 30%
2041117, // 반지 민첩 주문서 30%
2041119, // 반지 행운 주문서 30%
2041313, // 벨트 힘 주문서 30%
2041315, // 벨트 지력 주문서 30%
2041317, // 벨트 민첩 주문서 30%
2041319, // 벨트 행운 주문서 30%
2043005, // 한손 검 공격력 주문서 30%
2043018, // 한손 검 명중치 주문서 30%
2043105, // 한손 도끼 공격력 주문서 30%
2043113, // 한손 도끼 명중치 주문서 30%
2043205, // 한손 둔기 공격력 주문서 30%
2043213, // 한손 둔기 명중치 주문서 30%
2043305, // 단검 공격력 주문서 30%
2043604, // 케인 공격력 주문서 30%
2043705, // 완드 마력 주문서 30%
2043805, // 스태프 마력 주문서 30%
2044005, // 두손 검 공격력 주문서 30%
2044013, // 두손 검 명중치 주문서 30%
2044105, // 두손 도끼 공격력 주문서 30%
2044113, // 두손 도끼 명중치 주문서 30%
2044205, // 두손 둔기 공격력 주문서 30%
2044213, // 두손 둔기 명중치 주문서 30%
2044305, // 창 공격력 주문서 30%
2044313, // 창 명중치 주문서 30%
2044405, // 폴암 공격력 주문서 30%
2044413, // 폴암 명중치 주문서 30%
2044505, // 활 공격력 주문서 30%
2044605, // 석궁 공격력 주문서 30%
2044705, // 아대 공격력 주문서 30%
2044804, // 너클 공격력 주문서 30%
2044808, // 너클 명중치 주문서 30%
2044904, // 건 공격력 주문서 30%
];
var eItem = [
1442039, // 냉동 참치
1372033, // 하트 완드
1302049, // 광선 채찍
1302063, // 화염의 카타나
];
var dItem = [
2450000, // 사냥꾼의 행운
2049004, // 백의 주문서 10%
];
var bItem = [
2450000, // 사냥꾼의 행운
2049005, // 백의 주문서 20%
];
var fItem = [
2049005, // 백의 주문서 20%
2049116, // 놀라운 혼돈 주문서 50%
2049122, // 긍정의 혼돈 주문서 50%
1122017, // 정령의 펜던트
];

function run() {
    var r0 = Packages.server.Randomizer.nextInt(999);
    var r1 = Packages.server.Randomizer.rand(0, 100);
    var r2 = Packages.server.Randomizer.rand(1, 100);
    var r3 = Packages.server.Randomizer.nextInt(cItem.length - 1);
    var itemID = cItem[r3];
    if (r0 < 199) {
        r3 = Packages.server.Randomizer.nextInt(eItem.length - 1);
        itemID = eItem[r3];
    }
    if (r0 < 99) {
        r3 = Packages.server.Randomizer.nextInt(dItem.length - 1);
        itemID = dItem[r3];
    }
    if (r0 < 72) {
        r3 = Packages.server.Randomizer.nextInt(bItem.length - 1);
        itemID = bItem[r3];
    }
    if (r0 < 9) {
        r3 = Packages.server.Randomizer.nextInt(fItem.length - 1);
        itemID = fItem[r3];
    }
    if (r0 < 1) {
        itemID = 1142249; // 나는야 럭키 가이 ★
    }
    var quantity = 1;
    if (itemID == 2000004 || itemID == 2000005) {
        quantity = Packages.server.Randomizer.rand(10, 50);
    }
    return r1 + "," + r2 + "," + itemID + "," + quantity;
}